// Password Spray
let lookback = 24h;
SigninLogs
| where TimeGenerated >= ago(lookback)
| where ResultType in ("50053","50055","50126")
| summarize Failures=count(), Users=dcount(UserPrincipalName) by IPAddress, bin(TimeGenerated, 10m)
| where Failures >= 40 and Users >= 20
| order by Failures desc
